Revit 2026 API

# DuctSettingsRectangularDuctSizeSuffix Property

---

The rectangular duct size suffix string.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string RectangularDuctSizeSuffix { get; set; }
```
```vb
Public Property RectangularDuctSizeSuffix As String
	Get
	Set
```
```cpp
public:
property String^ RectangularDuctSizeSuffix {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member RectangularDuctSizeSuffix : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace